Emacs.org
#+title: EMACS CONFIG
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Basic UI Config

This section configures basic UI settings that remove unneeded elements to make Emacs look a lot more minimal and modern.  If you're just getting started in Emacs, the menu bar might be helpful so you can remove the =(menu-bar-mode -1)= line if you'd like to still see that.

#+begin_src emacs-lisp 

  ;; NOTE: init.el is now generated from Emacs.org.  Please edit that file
  ;;       in Emacs and init.el will be generated automatically!
  (setq inhibit-startup-message t) ;; Landing page in EMACS
  (scroll-bar-mode -1) ;; Disables scroll-bars
  (tool-bar-mode -1) ;; Disables the top toolbars
  (menu-bar-mode -1) ;; Disable the menu bar
  ;; Centralize Backup
  (setq backup-directory-alist '((".*" . "~/.local/share/Trash/files")))
  (setq scroll-step            1
        scroll-conservatively  10000)

  ;; Only warn about important stuff
  (setq warning-minimum-level :emergency)

  ;; Disable the modeline itself
  (setq-default mode-line-format nil) 

#+end_src

** Fonts Configuration

#+begin_src emacs-lisp 

  ;; Setting the fonts
  (set-face-attribute 'default nil :font "JetBrainsMono Nerd Font Medium" :height 130)
  (set-face-attribute 'fixed-pitch nil :font "JetBrainsMono Nerd Font Medium" :height 130)
  ;; (set-face-attribute 'variable-pitch nil :font "JetBrainsMono Nerd Font Medium" :height 140)
  (set-face-attribute 'font-lock-comment-face nil :slant 'italic)
  (set-face-attribute 'font-lock-keyword-face nil :slant 'italic)

  (custom-set-faces
   '(header-line
     ((t (:background "#11111b"))))
   )

  (defun chilly/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    (dolist (face '((org-meta-line . 0.7)
                    (org-level-1 . 1.7)
                    (org-level-2 . 1.5)
                    (org-level-3 . 1.4)
                    (org-level-4 . 1.3)
                    (org-level-5 . 1.3)
                    (org-level-6 . 1.3)
                    (org-level-7 . 1.2)
                    (org-level-8 . 1.1)))
      ;; (set-face-attribute (car face) nil :font "ETbb" :weight 'regular :height (cdr face))
      (set-face-attribute (car face) nil :font "Barlow" :weight 'medium :height (cdr face))
      )
    (set-face-attribute 'line-number nil :font "JetBrainsMono Nerd Font Bold" :height 90)

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

#+end_src


* Startup Performance
This section is where it make emacs faster to load.

** Garbage collection
Makes startup faster by reducing the frequency of garbage collection
#+begin_src emacs-lisp

  ;; Using garbage magic hack.
  (use-package gcmh
    :config
    (gcmh-mode 1))
  ;; Setting garbage collection threshold
  (setq gc-cons-threshold 402653184
        gc-cons-percentage 0.6)

  ;; Profile emacs startup
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "*** Emacs loaded in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))

  ;; Silence compiler warnings as they can be pretty disruptive (setq comp-async-report-warnings-errors nil)
#+end_src

** Native Compil
#+begin_src emacs-lisp

  ;; Silence compiler warnings as they can be pretty disruptive
  (if (boundp 'comp-deferred-compilation)
      (setq comp-deferred-compilation nil)
    (setq native-comp-deferred-compilation nil))
  ;; In noninteractive sessions, prioritize non-byte-compiled source files to
  ;; prevent the use of stale byte-code. Otherwise, it saves us a little IO time
  ;; to skip the mtime checks on every *.elc file.
  (setq load-prefer-newer noninteractive)
#+end_src


* Packages

** Initialization

Emacs has a built in package manager but it doesn't make it easy to automatically install packages on a new system the first time you pull down your configuration.  [[https://github.com/jwiegley/use-package][use-package]] is a really helpful package used in this configuration to make it a lot easier to automate the installation and configuration of everything else we use.

#+begin_src emacs-lisp

  ;; Initialize Package souces
  (require 'package)
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package) ;; sth-p in emacs is mostly a function that takes t or nil
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t) ;; Default is nil

#+end_src

** Catppuccin Theme

A very nice and minimal theme with pastel-like colors. I have modified the default =mocha= theme a little to make it work with my desktop theme itself.

#+begin_src emacs-lisp

  (use-package catppuccin-theme
    :init
    (setq catppuccin-flavor 'mocha)
    (setq catppuccin-italic-comments t)
    (setq catppuccin-italic-blockquotes t)
    :config
    (catppuccin-set-color 'base "#11111b")
    (catppuccin-set-color 'mantle "#0B0B11")
    (catppuccin-reload))

#+end_src

** Icons

This package provides icons for a lot of packages. So its always useful to have.

#+begin_src emacs-lisp
  (use-package all-the-icons)
#+end_src

** Hightlight Todos

A simple plugin to highlight particular words like TODO and NOTE which can be useful for detecting those specific lines.

#+begin_src emacs-lisp

  (use-package hl-todo
    :hook ((org-mode . hl-todo-mode)
           (prog-mode . hl-todo-mode))
    :config
    (setq hl-todo-highlight-punctuation ":"
          hl-todo-keyword-faces
          `(("TODO"       warning bold)
            ("FIXME"      error bold)
            ("HACK"       font-lock-constant-face bold)
            ("REVIEW"     font-lock-keyword-face bold)
            ("NOTE"       success bold)
            ("DEPRECATED" font-lock-doc-face bold))))

#+end_src

** DashBoard

The beautiful startup page that is fully customizable and works great with any themes.

#+begin_src emacs-lisp

  (use-package dashboard
    :ensure t 
    :init
    (setq initial-buffer-choice 'dashboard-open)
    (setq dashboard-set-heading-icons nil)
    (setq dashboard-set-file-icons t)
    (setq dashboard-banner-logo-title "You better crush it now.")
    (setq dashboard-show-shortcuts t)
    (setq dashboard-startup-banner "/home/chilly/.config/emacs/images/emacs-dash.png")  ;; use custom image as banner
    (setq dashboard-center-content t) ;; set to 't' for centered content
    (setq dashboard-items '((recents . 3)
                            (projects . 3)))
    :custom
    (dashboard-modify-heading-icons '((recents . "file-text")
                                      (bookmarks . "book")))

    :if (< (length command-line-args) 3)
    :config
    (dashboard-setup-startup-hook))

#+end_src


