init.el

(electric-pair-mode 1)       ;; Turns on automatic parens pairing

;; Custom functions
(defvar org-electric-pairs '((?/ . ?/)) "Electric pairs for org-mode.")
(defun org-add-electric-pairs ()
  (setq-local electric-pair-pairs (append electric-pair-pairs org-electric-pairs))
  (setq-local electric-pair-text-pairs electric-pair-pairs))

;; Disable the autocompletion of pairs <>
(add-hook 'org-mode-hook (lambda ()
                           (setq-local electric-pair-inhibit-predicate
                                       `(lambda (c)
                                          (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))

;; Dependency to lsp-bridge
(use-package yasnippet)
(yas-global-mode 1)
(use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "multimarkdown")
  :bind (:map markdown-mode-map
              ("C-c C-e" . markdown-do)))

(add-to-list 'load-path "~/.config/emacs/scripts/lsp-bridge/")

(require 'lsp-bridge)
(global-lsp-bridge-mode)

(use-package apheleia)
(apheleia-global-mode +1)
;; (add-hook 'prog-mode-hook #'format-all-ensure-formatter))

(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/Code")
    (setq projectile-project-search-path '("~/Code")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :after projectile
  :config (counsel-projectile-mode))

;; KEYMAPS
(use-package general
  :after evil
  :config

  (general-create-definer e/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")

  (e/leader-keys
    "SPC" '(counsel-M-x :which-key "M-x"))

  (e/leader-keys
    "f"  '(:ignore t :which-key "files")
    "ff" '(find-file :which-key "recent files")
    "fr" '(counsel-recentf :which-key "recent files"))

  (e/leader-keys
    "b"  '(:ignore t :which-key "buffer navigation")
    "bd" '(kill-buffer-and-window :which-key "kill the current buffer and window")
    "bn" '(next-buffer :which-key "󰛂 switch buffer")
    "bp" '(previous-buffer :which-key "󰛁 switch buffer")
    "bb" '(counsel-switch-buffer :which-key "view buffers"))  


  (e/leader-keys
    "s"  '(:ignore t :which-key "search")
    "ss" '(counsel-grep-or-swiper :which-key "use swiper")
    "si" '(all-the-icons-insert :which-key "search for icons")
    "sw" '(swiper-thing-at-point :which-key "swipe for this word")
    "saw" '(swiper-all-thing-at-point :which-key "swipe in all buffers for this word")
    "sm" '(swiper-all :which-key "swipe on other buffers")
    "sd" '(dictionary-search :which-key "search in dictionary"))

  (e/leader-keys
    "d" '(treemacs :which-key "treemacs"))

  (e/leader-keys
    "e"  '(:ignore t :which-key "evaluate")
    "eb" '(eval-buffer :which-key "evaluate buffer")
    "er" '(eval-region :which-key "evaluate region"))

  (e/leader-keys
    "c"  '(:ignore t :which-key "code")
    "ca" '(lsp-bridge-code-action :which-key "code actions")
    "cf" '(format-all-buffer :which-key "format the buffer"))

  (e/leader-keys
    "h"  '(:ignore t :which-key "help")
    "hF" '(describe-face :which-key "describe face")
    "hf" '(describe-function :which-key "describe function")
    "hv" '(describe-variable :which-key "describe variable")
    "hr"  '(:ignore t :which-key "reload")
    "hrb" '(revert-buffer-quick :which-key "reload buffer")
    "hrr" '((lambda () (interactive)
              (load-file "~/.config/emacs/init.el"))
            :wk "Reload emacs config"))

  (e/leader-keys
    "p"  '(projectile-command-map :which-key "project"))

  (e/leader-keys
    "t"  '(:ignore t :which-key "toggles")
    "tp"  '(perfect-margin-mode :which-key "perfect margin mode toggle")
    "tv"  '(visual-line-mode :which-key "toggle visual line mode")
    "tm"  '(minimap-mode :which-key "minimap toggles"))
  )

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-d-scroll t)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)


  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :after evil
  :config
  (setq evil-collection-mode-list '(dashboard dired ibuffer))
  (evil-collection-init))

(use-package evil-escape
  :after evil
  :init
  (evil-escape-mode 1)
  :config
  (setq-default evil-escape-key-sequence "jk"
                evil-escape-delay 0.3))

(use-package evil-commentary
  :after evil
  :init
  (evil-commentary-mode 1)
  :config)

;; Using RETURN to follow links in Org/Evil 
;; Unmap keys in 'evil-maps if not done, (setq org-return-follows-link t) will not work
(with-eval-after-load 'evil-maps
  (define-key evil-motion-state-map (kbd "SPC") nil)
  (define-key evil-motion-state-map (kbd "RET") nil)
  (define-key evil-motion-state-map (kbd "TAB") nil))

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
;; (define-key prog-mode-map (kbd "C-x M-t") 'counsel-load-theme)

(define-key evil-motion-state-map (kbd "C-h") 'nil)
(define-key global-map (kbd "C-h") #'nil)
(define-key evil-normal-state-map (kbd "C-h") 'nil)
(define-key evil-insert-state-map (kbd "C-h") 'nil)
(define-key acm-mode-map (kbd "C-h") #'nil)

(define-key evil-insert-state-map (kbd "C-j") 'nil)
(define-key evil-insert-state-map (kbd "C-k") 'nil)
(define-key evil-insert-state-map (kbd "C-l") 'acm-complete)

(define-key global-map (kbd "C-j") #'acm-select-next)
(define-key global-map (kbd "C-k") #'acm-select-prev)
(define-key global-map (kbd "C-l") #'acm-complete)

(define-key acm-mode-map (kbd "C-l") 'acm-complete)
(define-key acm-mode-map (kbd "C-j") 'acm-select-next)
(define-key acm-mode-map (kbd "C-k") 'acm-select-prev)

;; Setting RETURN key in org-mode to follow links
(setq org-return-follows-link  t)
(electric-indent-mode -1)    ;; Turn off the weird indenting that Emacs does by default.
(setq org-src-preserve-indentation nil)
(setq org-edit-src-content-indentation 2) ;; Set src block automatic indent to 0 instead of 2.
(defun chilly/org-mode-setup ()
  (org-indent-mode)
  ;; (variable-pitch-mode 1) ;; Makes things much slower in org mode
  )

(use-package org
  :hook (org-mode . chilly/org-mode-setup)
  :config
  (setq org-ellipsis " ❋")
  (chilly/org-font-setup))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)))

(push '("conf-unix" . conf-unix) org-src-lang-modes)

(setq org-confirm-babel-evaluate nil)
