Emacs.org
** Autotangle Config files
#+begin_src emacs-lisp

  ;; Automatically tangle our Emacs.org config file when we save it
  (defun chilly/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.config/emacs/Emacs.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'chilly/org-babel-tangle-config)))
#+end_src


** Org Tempo
The shortcuts used in org-mode
#+begin_src emacs-lisp

  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))

#+end_src


* End Configs

**  Disable buffers
#+begin_src emacs-lisp

  ;; Get rid of the extra buffers
  (setq-default message-log-max nil)

  ;; Makes *scratch* empty.
  (setq initial-scratch-message "")

  ;; Removes *scratch* from buffer after the mode has been set.
  (defun remove-scratch-buffer ()
    (if (get-buffer "*scratch*")
        (kill-buffer "*scratch*")))
  (add-hook 'after-change-major-mode-hook 'remove-scratch-buffer)

  ;; Removes *messages* from the buffer.
  (setq-default message-log-max nil)
  (kill-buffer "*Messages*")

  ;; Removes *Completions* from buffer after you've opened a file.
  (add-hook 'minibuffer-exit-hook
            '(lambda ()
               (let ((buffer "*Completions*"))
                 (and (get-buffer buffer)
                      (kill-buffer buffer)))))

  ;; Don't show *Buffer list* when opening multiple files at the same time.
  (setq inhibit-startup-buffer-menu t)

  (set-frame-parameter (selected-frame) 'buffer-predicate
                       (lambda (buf) (not (string-match-p "^\*.*\*" (buffer-name buf)))))

  ;; Show only one active window when opening multiple files at the same time.
  (add-hook 'window-setup-hook 'delete-other-windows)

#+end_src

** Scripts
#+begin_src emacs-lisp

  ;; To add the scripts  
  (add-to-list 'load-path "~/.config/emacs/scripts/")

#+end_src

*** Minimap
#+begin_src emacs-lisp

  ;;MINIMAP
  (require 'minimap)
  (setq
   ;; Configure minimap position
   minimap-window-location 'right ; Minimap on the right side
   minimap-width-fraction 0.0 ; slightly smaller minimap
   minimap-minimum-width 20 ; also slightly smaller minimap
   minimap-maximum-width 30 ; also slightly smaller minimap

   minimap-dedicated-window t ; seems to work better
   minimap-enlarge-certain-faces nil ; enlarge breaks BlockFont
   )
#+end_src

***  Symbols
#+begin_src emacs-lisp

  ;; ORG-BULLETS

  (require 'org-bullets)
  (setq org-bullets-bullet-list '("⟶ " "⟶ " "⟶ " "⟶ " "⟶ " "⟶ "))
  ;; (setq org-bullets-bullet-list '(" " " " " " " " " " " "))
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
  (setq org-hide-emphasis-markers t)

  (defun my/org-mode/load-prettify-symbols ()
    (interactive)
    (setq prettify-symbols-alist
          '(("#+begin_src" . " ")
            ("#+BEGIN_SRC" . " ")
            ("#+end_src" . " ")
            ("#+END_SRC" . " ")
            ("#+title:" . " ")
            ("#+TITLE:" . " ")
            ("#+begin_example" . ?)
            ("#+BEGIN_EXAMPLE" . ?)
            ("#+end_example" . ?)
            ("#+END_EXAMPLE" . ?)
            ("#+header:" . ?)
            ("#+HEADER:" . ?)
            ("#+name:" . ?﮸)
            ("#+NAME:" . ?﮸)
            ("#+results:" . ?)
            ("#+RESULTS:" . ?)
            ("#+call:" . ?)
            ("#+CALL:" . ?)
            (":PROPERTIES:" . ?)
            (":properties:" . ?)
            ("TODO" . "")
            ("DONE" . "")
            ("|" . "│")
            ("[ ]" . "☐")
            ("[X]" . "☑")
            ("[-]" . "❍")
            ))
    (prettify-symbols-mode 1))

  (add-hook 'org-mode-hook 'my/org-mode/load-prettify-symbols)

  (defun prettify-set ()
    (interactive)
    (setq prettify-symbols-alist
          '(("lambda" .  "λ")
            ("|>"	 . "▷")
            ("<|"	 . "◁")
            ("->>" . "↠")
            ("->"	 . "→")
            ("<-"	 . "←")
            ("=>"	 . "⇒")
            ("<="	 . "≤")
            (">="	 . "≥")
            ))
    (prettify-symbols-mode 1))
  (add-hook 'prog-mode-hook 'prettify-set)

#+end_src

** Miscelleneous
#+begin_src emacs-lisp

  ;; prevent number lines to show in terminals NOTE: Removed org-mode-hook
  (dolist (mode '(term-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  (column-number-mode)
  (global-display-line-numbers-mode t)
  (auto-revert-mode 1)	     ;; Revert the buffer automatically


  ;; DONT TOUCH THIS:
  (custom-set-variables
   ;; custom-set-variables was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(package-selected-packages
     '(hl-todo minimap org-modern counsel-projectile projectile hydra all-the-icons helpful perfect-margin which-key evil-commentary evil-escape evil-collection evil general rainbow-delimiters ivy-rich counsel swiper catppuccin-theme)))
  (custom-set-faces
   ;; custom-set-faces was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   )
#+end_src
